[
  {
      "id": "guest-lecture-sharma",
      "title": "Guest Lecture Series: Dr. Anya Sharma",
      "date": "July 10, 2025",
      "description": "Exploring advancements in Quantum Topology. Open to all researchers and students. Dr. Sharma is a distinguished mathematician known for her groundbreaking work in algebraic topology and its applications. This lecture promises to be a deep dive into the latest theories and unsolved problems in the field, offering valuable insights for both seasoned researchers and aspiring mathematicians.",
      "link": "https://ksom.res.in/events/guest-lecture-sharma"
  },
  {
      "id": "discrete-math-conference",
      "title": "International Conference on Discrete Mathematics",
      "date": "August 5, 2025",
      "description": "Leading experts convene to discuss new theories and applications in discrete mathematics. This annual conference brings together top researchers from around the globe to present their latest findings, collaborate on new projects, and discuss the future directions of discrete mathematics. Topics include graph theory, combinatorics, cryptography, and theoretical computer science.",
      "link": "https://ksom.res.in/events/discrete-math-conference"
  },
  {
      "id": "freshers-orientation",
      "title": "Freshers' Orientation Program",
      "date": "September 1, 2025",
      "description": "Welcome session for new M.Sc. and Ph.D. students joining KSoM. This comprehensive orientation will introduce new students to KSoM's academic environment, research facilities, faculty members, and campus life. It's an excellent opportunity to meet fellow students, get acquainted with the institute's resources, and prepare for a successful academic journey.",
      "link": "https://ksom.res.in/events/freshers-orientation"
  },
  {
      "id": "ml-math-workshop",
      "title": "Workshop on Machine Learning in Mathematics",
      "date": "October 20, 2025",
      "description": "A practical workshop on the intersection of machine learning and mathematical research. This workshop will cover fundamental concepts of machine learning and demonstrate how mathematical principles underpin various ML algorithms. Participants will engage in hands-on sessions exploring topics like neural networks, optimization, and data analysis, with a focus on their mathematical foundations.",
      "link": "https://ksom.res.in/events/ml-math-workshop"
  },
  {
      "id": "alumni-meet",
      "title": "Annual Alumni Meet",
      "date": "November 12, 2025",
      "description": "Connect with fellow KSoM alumni and faculty. Networking and dinner included. Our annual alumni meet is a cherished tradition, providing a platform for former students to reconnect, share their professional journeys, and foster a strong KSoM community. This event includes a keynote address from a prominent alumnus, a networking reception, and opportunities to reminisce about your time at KSoM.",
      "link": "https://ksom.res.in/events/alumni-meet"
  },
  {
      "id": "christmas-lecture",
      "title": "Christmas Lecture: The Beauty of Fractals",
      "date": "December 8, 2025",
      "description": "A public lecture showcasing the visual and mathematical elegance of fractals. This captivating lecture is designed for a general audience, exploring the fascinating world of fractals found in nature, art, and mathematics. Through stunning visuals and accessible explanations, Professor Emily Davis will reveal the intricate patterns and profound mathematical concepts behind these infinitely complex shapes.",
      "link": "https://ksom.res.in/events/christmas-lecture"
  }
]

